//
//  Data.swift
//  HowToMakeTableview
//
//  Created by Donlaya on 26/9/2561 BE.
//  Copyright © 2561 Donlaya. All rights reserved.
//

import Foundation

class Data {
    
    var imageOfdog: [String] = ["french", "pug"]
    var nameOfdog: [String] = ["French Bulldog\rFrenchy", "PUG"]
    var dataOfdog: [String] = ["เฟรนช์ บูลด็อก หรือที่เรียกอีกอย่างหนึ่งว่า เฟรนชี่ นี้ ถึงแม้ว่าหน้าตาจะดูน่ารักแบบแปลก ๆ แต่ถิ่นฐานบ้านเกิดของเขาไฮโซมาก นั่นก็คือ ประเทศฝรั่งเศส รูปร่างกลม ๆ ป้อม ๆ บวกกับขาสั้น ๆ ทำให้เวลาเดิน สะโพกของ เฟรนช บูลด็อก จะส่ายไปมา เมื่อรวมเข้ากับจมูกสั้น ย่น ปากกว้างที่ดูเหมือนยิ้มตลอดเวลา และใบหูอันใหญ่โตที่คล้ายกับหูค้างคาว ทำให้ใคร ๆ ที่ได้พบ เฟรนช์ บูลด็อก อดที่จะอมยิ้มไม่ได้ มีนิสัยร่างเริง และเป็นมิตร เขาอาจจะเห่าเพื่อเตือนให้เราทราบว่ามีคนแปลกหน้ามาป้วยเปี้ยนอยู่แถวนี้ นอกจากนั้นเขาจะไม่เห่าพร่ำเพรื่อ แต่ถ้าหากสังเกตว่า เฟรนช์ บูลด็อก หายใจทางปากถี่ขึ้นจนผิดปกติ ควรรีบนำเขาเข้าที่ร่มหรือห้องแอร์โดยเร็ว และหากมั่นใจว่าเขาอาจจะเป็นฮีทสโตรก (ชักเนื่องจากความร้อน) ควรลดอุณหภูมิร่างกายของเขาให้เร็วที่สุด เช่น เอาน้ำราด เอาน้ำแข็งไปโปะ แล้วพาไปหาหมอให้ฉีดยากันชักโดยเร็ว", "ปั๊ก เป็นสุนัขพันธุ์เล็ก มีร่างกายเล็กปานกลาง มีหน้าสั้นและย่น ใบหูพับตก และมีขนสั้นเกรียน หางมีลักษณะ บิดเป็นเกลียวชี้ขึ้นม้วนจนเป็นวงติดกับบั้นเอว ถ้าหากหางม้วนได้ถึงสองตลบก็จัดว่าเป็นลักษณะที่สวยสมบูรณ์ทีสุด หายใจและกรนเสียงดัง เป็นสุนัขที่ถูกผสมพันธุ์ออกมา จนได้สัดส่วนรูปร่างที่กระทัดรัดเป็นสี่เหลี่ยมจัตุรัส ตัน และมีกล้ามเนื้อที่แข็งแรง หัวมีลักษณะเป็นสี่เหลี่ยมจัตุรัสเชิดขึ้นเล็กน้อย ตากลมยื่นออกมาแลดูอ่อนโยน มีสีดำเป็นประกาย หูสั้นตกลงข้างหัวมีความนุ่มคล้ายกำมหยี่ คอสันโค้งเล็กน้อย หางขี้ขึ้นด้านบนม้วนเป็นวงจนติดบั้นเอว ถ้าหากหางม้วนได้ถึงสองตลบก็จะจัดว่าเป็นลักษณะที่สวยงามที่สุด ขาหน้าเหยีดตรง มีขนสั้นละเอียดเป็นประกาย มีสีเหลื่องแอพพริค็อด มี Marking สีดำที่หน้าและใบหู เป็นที่นิยมเลี้ยงกันมาก ปั๊กเป็นสุนัขที่มีนิสัยน่ารัก น่าเลี้ยงอีกต่างหาก ถึงหน้าตาเขาจะดูเหมือนคิดมากไปหน่อยถ้าได้ลองเลี้ยงแล้วจะหลงใหลโดยไม่รู้ตัว เพราะความอ่อนโยนของมัน ข้อควรระวังในการเลี้ยงคือสภาพอากาศที่ร้อนปั๊กจะทนไม่ค่อยจะได้ ถ้าทนไม่ไหวอาจเป็นลมแดดได้ และถ้าอากาศเย็นควรให้อยู่ในที่อุ่น ๆ หรือหาเสื้อมาสวมให้เพื่อป้องกันไม่ให้เป็นหวัด"]
    
    var breedsType = ["french", "pug"]
    var frenchAllPicture = ["f1", "f2", "f3", "f4", "f5", "f6", "f7", "f8", "f9", "f10"]
    var pugAllPicture = ["p1", "p2", "p3", "p4", "p5", "p6", "p7", "p8", "p9", "p10"]
    
}

enum BreedTypeEnum: String {
    
    case french = "french"
    case pug = "pug"
}
